Tekla Open API Reference for Tekla Structures 2025
DimensionPlacingAttributes Properties
The DimensionSetBaseAttributes.DimensionPlacingAttributes type exposes the following members.
Properties
Name | Description
Direction
 The placing direction.
Distance
 The placing distance attributes.
Placing
 The placing type.
Top
See Also
Reference
DimensionSetBaseAttributes.DimensionPlacingAttributes Class
Tekla.Structures.Drawing Namespace